Revit 2024 API
CableTray.GetShapeType Method
 Returns the shape type for the cable tray.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CableTrayShape GetShapeType()
Visual Basic
Public Function GetShapeType As CableTrayShape
Visual C++
public:
CableTrayShape GetShapeType()
Return Value
 The shape type.
See Also
CableTray Class
Autodesk.Revit.DB.Electrical Namespace